{
    "blogEntries":[
    {
    "id": "1",
    "timestamp": "4/1/2018 - 12:02:00 AM",
    "image": "photo-1519276259990-216d5c67e2a8.jpg",
    "content": "In my experience, the biggest frustration that I had with my wife is that she had nothing to contribute to our sex life apart from her body. I was always the one trying to get us to do new things, or rather trying to have an actual sex life and not just have sex. She was always willing to try new things when I would suggest them… but she had nothing to suggest herself. For her, just having sex was plenty. Being the one in control of everything all the time made me feel very lonely and shifted the co-ownership of our sex life to just one owner, me. This killed all the thrill of sex between us for me. If all she could offer is a warm body… then how different is that really from masturbation? To her it was all about the climax and feeling of intimacy, to me it was all about the experiencing another person on as many levels as I could. <br /><br />To keep experiencing her, I needed her to be my partner and not my vessel for climax. For me to feel and reciprocate intimacy, I needed her to be a co-owner of our sex life. I could see this problem from a mile away but no matter how hard I tried to articulate it to her the point was never coming across as anything but I am just sexually frustrated. She’d maybe browse a few adult websites after I’d bring it up and attempt to make a few unspecific suggestions that I could easily tell she didn’t really have a passion for. But she exhibited no excitement over it. While I was happy she tried, this was getting us nowhere. I needed an X-Factor... <br /><br /> So we tried therapy. <br /><br /> To my surprise, this helped a lot. The therapist explained our relationship to her (similar to how I have outlined it to you) and encouraged her to take a more active role in our sex life. She gave my wife several, very kinky, suggestions and help to level the playing field by having her focus on getting turned on by knowing how much those kinky activities could turn me onto her. Then it was my turn. After sex, I was to initiate some light foreplay. Which was a little backward I know but simple activities such as brushing my fingers along her back and legs after sex while we just enjoyed each others company made her feel fulfilled. This came really REALLY easy for me after she was able to contribute. All of a sudden, I wanted to be around her more again. I started feeling less lonely. It was a domino effect that started with her. When she is a co-owner of our sex life, intimacy came naturally to us. When I am the sole owner, the intimacy has to be forced out of us. ",
    "comment": "TRY THIS: Casually bring up a kinky sexual activity during the day and hint to your Kink through out the day that the activity is on your mind. Something like, ''I’m really horny. I’ve been thinking about you cumming on my butt all day today.'' and ''I cant wait until the kids are in bed tonight. I need to feel your sperm on my body.'' Pretty hardcore, right? Well, maybe for some but baby steps for now. I will be posting a list of some of the kinkiest activities I’ve enjoyed or have found online that take little to no effort or skill from your part. The best part is, your Kink will likely go nuts over the idea and your barely had to do anything! ",
    "author": "Kink4Vanilla",
    "genre": "",
    "title": "Bringing Something To The Table"
    },
    {
    "id": "2",
    "timestamp": "5/12/2018 - 1:08:00 PM",
    "image": "maria-fernanda-gonzalez-461521-unsplash.jpg",
    "content": "Sexual Confidence is a defining characteristic that is sought after (immensely) by both sexes. Sexual Confidence in yourself will not only make you happier, but it will also provide you with a much more fulfilling sex life. We’ve all run into women or men that seem less objectively attractive to us but yet somehow manage to capture your eyes and interest. So what makes them different? They love themselves and ergo are confident in their body language and overall composure. When you love and accept yourself your inhibitions go away and you are free to just enjoy the moment as oppose to analyzing your composure and performance constantly. <br /><br /> Couples where both partners are sexually confident are notably happier in their relationships and experience a closeness that- well, others just don’t. For a lot of people, women in particular, Sexual Confidence can come with age and experience. There is a reason that younger men and women are attracted to older lovers and that’s because those older lovers have grown past their own insecurities. You not only (and obviously) owe Sexual Confidence to your self- but you also owe it to your partner too. Relationships can become very fragile and boring when one partner has confidence and the other does not. Sexual encounters can often start feeling like masturbation and getting aroused can often feel like a chore when the balance is off. This is because a lack of Sexual Confidence prohibits depth to the relationship. A common outcome for the already Sexual Confident partner in a marriage is a feeling of being trapped or tied down- and more often than not, will ultimately lead to resentment toward the less Sexually Confident partner and the relationship as a whole. Furthermore, the more Sexually Confident partner is already likely receiving lots of attention from the opposite sex which becomes more and more evident to them as your relationship with them grows more and more stale. This can and will leave your partner unhappy, frustrated, and in many cases- create a wanting for infidelity or divorce. <br /><br /> Its been said again and again: ''Sex, money, and kids are the highest reasons for divorce.'' <br /><br /> I believe this to be true- but only if they are left unchecked. <br /><br />Conclusion-Find out and do what it takes to be Sexually Confident. Leave your inhibitions and self-doubt behind. Be happy with yourself and your body and your confidence will blossom. And always remember- <br /><br /> ''Your partner was attracted to you to begin with. Keeping them attracted to you has less to do with the baggage you obsess over and everything to do with your ability to be happy and maintain the depth you have in your relationship.''<br /><br />Here are a few activities that can help boost your sexual confidence:<br /><br />-Exercise!!!! People that exercise (and take their fitness seriously) are almost always overflowing with Sexual Confidence… and Good News! You don’t need to be a fitness model to get it! Your workouts in itself will help keep a healthy balance of hormones in the brain that will help keep you happy. Take a serious approach to your routine and goals and make it your lifestyle.  As I outlined above, your objective image isn’t everything.. but taking a serious approach to yourself will help your look more inward as well as boost your confidence. I cannot stress this enough!! <br /><br />-Masturbate! Yes, Masturbate! Masturbation can help you feel good about yourself too! But don’t just rub one out. Get creative! Try to make your experience as fun as possible! Try to make yourself squirt, incorporate food, be daring and try to sneak a quick orgasm in while in public place, get yourself as close as you can to climax and stop before orgasm several times before your actual orgasm, play with yourself in the shower every morning, try peeing in shower while playing with yourself, make a video of you playing with your best assets, masturbate while your partner masturbates to you, etc, etc, etc, JUST MASTURBATE! <br /><br />-Dialogue! Try to keep an ongoing sexual dialogue between you and your partner. Not just ''I want you tonight''- get some depth in there! ''I want you to eat fruit out of my pussy'', ''I’ll bet that champagne would taste good on me.'', ''I want you to massage my back with your seed tonight.''. DO NOT UNDERESTIMATE DIALOGUE. Dialogue creates desire, interest, and frankly.. something to look forward to. <br /><br />-Demand! Be demanding! Ask for something, anything! Asking your partner for oral sex is way hotter for your partner than just hoping for it. Be sure to be creative and keep things interesting by changing up your needs. But be assured, having a demand or need (even if its mundane) will help keep your partner interested and help to maintain a healthy balance of power in the bedroom.",
    "comment": "",
    "author": "Kink4Vanilla",
    "genre": "",
    "title": "Sexual Confidence"
    },
    {
    "id": "3",
    "timestamp": "6/21/2018 - 11:11:00 AM",
    "image": "pexels-photo-325900.jpeg",
    "content": "Our last blog post sparked an idea that a few members from our panel of couples brought to our attention regarding the growing numbers of couples and women with personal sex blogs. What is a sex blog you ask? A sex blog is basically a blog in which you post both either nude or sexual pictures (or both) of your self online for others to like, comment, and reblog. They come in all forms and vary in genre and dialogue. Some sex bloggers are just about pictures and images, others add in stories about their sexual encounters, and etc. There are really no rules. Why couples and women and not men? Most men are not looking for a sexual confidence through sex blogs. I do believe they exist... somewhere. But let's face it- most us guys are looking for a different kind of ''outlet'' when it comes to sex blogs. <br /><br />To start off, we can easily see how ''likes'', ''reblogs'', ''shares'', and ''comments'' can provide someone with affirmations regarding how attractive they are, how sexy they can be, etc. But we wanted to know more. What sparked their initial interest in starting a sex blog? How much has having a sex blog increased their sexual confidence? How does it translate to their sex lives?  We decided to reach out to several of them for feedback regarding these and other questions and discovered some interesting facts. For one, almost everyone we reached out to was very happy to respond and this resulted in an almost 90% participation rate.  Almost every participant had a happy, energetic, and positive attitude in their responses as well which we felt likely translated into a happy relationship or home life.  So without further ado- here are the questions we asked with a summary of how the participants responded:<br /><br /><strong>How, why, and what got you into <em>Sex Blogging</em>?</strong><br />We received a bit of a variety of answers for this question, however, we were able to compile that the participants were either introduced to the sex blog world from their spouse or they stumbled upon sex blogging via perusing the internet. In several cases, it started with a husband asking their permission to submit a nude or semi-nude photo of them to an already existing sex blog and after reviewing the responses- they were hooked. In several other cases, after viewing other sex blogs, they decided it was a nice outlet for their desire to be exhibitionists and the thought of anonymous exposure was a huge turn on to them. Another popular topic that came up was the need for validating that they were still attractive and sexual after having kids. At any rate, in most cases, it only took them one or two exposures to sex blogs before they were hooked and wanted to try it on their own. <br /><br /><strong> What impact has <em>Sex Blogging</em> had on your overall sexual confidence?</strong><br />Every single response we got to this question was positive. Some responses include ''my confidence sky-rocketed almost overnight'', ''I never knew I was capable of sexual confidence until I started a sex blog'', and a few said ''duh'' and ''fucking right''... To go a little deeper, some participants went on to say that their spouses have always given them sexual confidence in the bedroom but they never really felt or experienced sexual confidence outside of their sex lives. Sex blogging helped them to bridge that gap with the end result of giving them a more content sense of overall happiness as well as being more comfortable with their bodies.<br /><br />''It forces me to realize that I am a sexual being and even on my worse days, people still find me attractive.'' <br /><em>-Ana, Sex Blogger</em><br /><br />''It's like I never feel down about myself. If I start to, I just read all the nice things people are saying about me and I am back on top. It's my personal confidence booster.''<br /><em>-Liz, Sex Blogger</em><br /><br /><strong>What kind of comments and questions do you receive from your followers on your <em>Sex Blog</em>? </strong><br />On the comments side, most of the comments are things like ''Wow you are beautiful!'', ''You have such a sexy ass.'',  ''Your husband is such a lucky man'',  and ''I would do [INSERT SEX ACT HERE] to you.'' are very common. And even if the sex blogger found a comment to be perverted or gross to them, they still get the message that the follower finds them to be attractive and sexy. On the question side, things were a little harder to summarize. Sex bloggers get a whole array of questions ranging from simple and innocent to downright debaucherous. On the innocent side, questions about their personal life such as ''How long have you and your spouse been together'' to ''What kind of food do you feed your cat?'' are very common. Requests for pictures or videos of the sex blogger in a specific pose or performing a specific task (both sexual and non-sexual) are very common as well. There are, however, some creeps out there that will ask if they can meet you, or would you perform a specific sex act on them and everything in between. Sex bloggers control these questions by answering them forthrightly and noted that failure to answer them only encouraged more questions of this nature. Also, sex bloggers on most blog sites (such as Tumblr) can simply just block the follower and move on. Notably, other followers of their sex blog will come to their defense as well. Which leads us to the next question- <br /><br /><strong>How do negative comments or ''trolls'' make you feel?</strong><br />Not surprisingly, all the confidence sex bloggers get from the bulk of their follows far surpasses the few crappy negative comments they get. Some sex bloggers have noted that they have really only received one or two negative comments in several years. As mentioned in the previous question, more often than not, their follows will come to their defense and reassure them that the negative comment is untrue or that they like that about them. But again, most sex bloggers just simply block the... pond scum.<br /><br /><strong>How does having a <em>Sex Blog</em> affect your sex life?</strong><br />Again, this had an overwhelmingly positive response. Sex bloggers find themselves trying and enjoying things they never thought they'd try. Their sexual personality becomes confident and strong. Their sex drive increases. And it creates a desire and catalyst for sexual exploration both alone and with their spouse. Overall- we couldn't find bad feedback for this question no matter how hard we tried. So the main bullet point here is that for many people, validation outside of your spouse can help you become the sexual being you never knew you were. <br /><br /><strong>Is there any advice veteran <em>Sex Bloggers</em> can give to anyone interested in started their own sex blog?</strong><br />Of course there is!<ul><li>Never show your face. Anonymity will keep you safe.</li><li>Sample other sex blogs, their questions, poses, etc to get a good idea for how you want to structure yours. </li><li>Be honest about yourself. You want confidence for being you not for being someone you are not.</li><li>You can be identified by tattoos, rooms in your house, etc. Make sure each picture you post doesn't give anything away about your identity. </li><li>A good site to start your sex blog on is Tumblr. It's free, easy to use, and allows for all basic functionality needed to get started. </li><li>Just do it! You are anonymous. What have you got to lose?</li></ul><br />Finally, I do realize this post and these participants do not represent sex bloggers as a whole. However, it's both interesting and encouraging to see how sex blogging has had a positive impact on so many people. If you take away anything from this post, it should be that whether you choose to start a sex blog or not, there are always people out there that find you as an attractive sexual being.",
    "comment": "",
    "author": "Kink4Vanilla",
    "genre": "",
    "title": "Sex Blogging For Sexual Confidence"
    },
    {
    "id": "4",
    "timestamp": "7/24/2018 - 4:11:00 PM",
    "image": "jamakassi-343173-unsplash.jpg",
    "content": "Pornography. Is it a problem? Is it a tool? Does it ruin or enhance our sex lives? These are all questions you find on the internet with a great contrast of perspectives. All of which are focused on a small sample of statistics with very opinionated writers. For example, there is a published article in Cosmo that questioned 68 some professional sex therapists about porn and relationships and its effect on people. For clarity, we have no idea who these sex therapists are, if they're accredited, if they attended school or just call themselves sex therapists, etc. The panel of sex therapists they questions had an overwhelmingly negative response but didn't really tell us anything we don't already know... in fact their responses were basic common sense that would be applicable to everything from eating too much food to watching too many cartoons to overdoing it on the video games. The author of the article likely just had their own propaganda. But let's be honest- most articles of this nature are mainly produced to get you a web page that has advertisements on it and should NOT be taken as a source of reality but at most an opinion. This article is not intended to sway you in anyway but simply give you a concept to consider is to why we support pornography.  The truth is that anything in excess can be detrimental to a person or relationship but it all depends on the person or people. One person could watch porn every day for weeks with no adverse effects and another person might find too much porn makes it harder to get aroused. It may cause problems in one relationship but could be a tie that binds in another. I'm not going to go much deeper here on whether or not porn is a risk or unhealthy. To be honest- I find all the articles online disputing this to be ridiculous and most are just baiting you for advertisement revenue. As with anything in life, you can tell if something is having an adverse effect on your life by simply taking a step back and asking yourself ''Is what I am doing over isolating me and prohibiting me from functioning in life.'' If the answer is ''no''. Then don't waste any more time thinking about it. It's always important to keep yourself in check from time to time with all the things you do. But don't waste your time believing what some unknown sex therapist said online. You know you better than anonymous does. <br /><br /><strong>So what does Vanilla4Kink think about porn? </strong><br /> We fucking love it! And so does the entire world. But the real question here should be: <br /><br />''How can porn benefit me in my journey from Vanilla to Kink?''<br /><br />Porn can be an extremely useful tool to Vanilla partners looking to bridge the Kink gap in their sex lives. It can culture you, condition you, and give you ideas for fun things to do in the bedroom... or by yourself. To help paint a picture and support our claim we did a small case study/experiment which produced some supporting results. The participants were Vanilla partners ages 25 to 45 who have been in a committed relationship for more than 2 years. Here is what we asked them to do:<br /><br /><strong>The experiment:</strong><ul><li>Watch 10-20 mins of porn 2-3 times a day for 1 month.</li><li>The pornography you choose must be specific to a fetish and the genre must be consistent for the whole experiment.</li></ul><br /> We also asked/encouraged the participants to engage in masturbation while watching their select genre of porn when and if possible. Sounds like a lot of porn watching, right?  We thought so too, so we gave them some ideas (and incentives) in how they could fit it into their busy lives. Instead of playing ''Angry Birds'' while ''doing your business in the thrown room'' watch porn. Facebooking while you wait for that roast to come out of the oven? Watch porn. Panning through some ''Funny Vines'' on social media? Watch porn. You get the idea. <em>We'll give you some more tips if you'd like to try the experiment yourself at the end of this article. </em> As I mentioned before, the results of this little experiment were very supporting. We found that most of the participants were able to sexualize the specific fetish that they really couldn't sexualize before. They basically trained and conditioned their brains to get aroused by their chosen fetish and felt more prone to incorporate it into their sex lives. The two participants that were unable to sexualize the fetish they chose both told us that they now felt more receptive to that fetish and would be willing to partake in that fetish if their partner was into it.  Amazing huh? Not really. We are constantly being trained and conditioned by the media around us and its really no secret that the media we force our brains to consume has a direct effect on us. The same goes for porn.  With a little effort and perseverance, you can train and condition yourself to like, enjoy, crave, or at least tolerate just about anything. You just have to want it. Want it for you or want it for your relationship and sex life. <br /><br />Last, before we give you some tips on how you can perform this experiment yourself, I wanted to mention that in our first article titled ''Bringing Something To The Table'' I discussed how co-owning your sex life is critical to your sex life... and your relationship. This little experiment certainly felt like a pathway to getting there. For encouragement, imagine how shocked and impressed your kinky counterpart will be when they see you finally come into your own in the bedroom. <br /><br />Here are some tips to consider if you choose to try our porn experiment: <ul><li>Accountability and commitment. Make sure you go all in and commit to the experiment. Don't take the half-assed approach. It helps to either have your partner or a friend help keep you accountable. Want to keep it private? You can always find someone in the Vanilla4Kink community willing to help keep you committed as well.</li><li>As outlined in the experiment, stick to one genre/fetish for the entire duration of the experiment.</li><li>To simplify your porn watching schedule, replace something you do already that you might need a break from anyway with porn. Let's face it, we all need a break from social media, youtube, and  Angry Birds from time to time anyway. </li><li>The duration of each porn watching session is meant to be a minimum. If you're getting into it and have the time- keep going. </li><li>Play with yourself during your porn sessions whenever possible. Remember, you are training your brain to sexualize a fetish and arouse you. If you're experiencing pleasure while watching something, your brain will take the hint that you want that something to arouse you. You don't necessarily need to achieve an orgasm. In fact, playing with yourself and prohibiting yourself from achieving orgasm (also known as ''edging'') periodically will likely enhance your experience. </li></ul><br />Please do note that this was a preliminary experiment with a small panel of participants (8). If you do plan on trying our little experiment, please do let us know the outcome. We do have plans on taking this experiment to a larger panel of participants for further research as well as enhancing it for our ''Vanilla2Kink Bootcamp'' challenge that's currently in the works and would LOVE to hear your feedback and ideas.",
    "comment": "",
    "author": "Kink4Vanilla",
    "genre": "",
    "title": "An Experiment With Porn"
    }
]}